RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_interrupts.c
/******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/*****************************************************************************/
/** \file hc32f460_interrupts.c
 **
 ** A detailed description is available at
 ** @link InterruptGroup Interrupt description @endlink
 **
 **   - 2018-10-12 CDT First version for Device Driver Library of interrupt.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_interrupts.h"
#include "hc32f460_utility.h"

#if (DDL_INTERRUPTS_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup InterruptGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*! Parameter validity check for null pointer. */
#define     IS_NULL_POINT(x)        (NULL != (x))

/*! Max IRQ Handler. */
#define     IRQ_NUM_MAX             (128u)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
func_ptr_t IrqHandler[IRQ_NUM_MAX] = {NULL};

/*! Parameter validity check for EXINT channel. */
#define IS_EXINT_CH(ch)                                                         \
(   ((ch) != 0x00UL)                            &&                              \
    (((ch) | EXINT_CH_MASK) == EXINT_CH_MASK))

/**
 *******************************************************************************
 ** \brief IRQ Registration
 **
 ** param [in]                          pstcIrqRegiConf, IRQ registration
 **                                     configure structure
 **
 ** retval                              Ok, IRQ register successfully.
 **                                     ErrorInvalidParameter, IRQ No. and
 **                                     Vector No. are not match.
 **                                     ErrorUninitialized, Make sure the
 **                                     Interrupt select register (INTSEL) is
 **                                     default value (0x1FFu) before setting.
 **
 *****************************************************************************/
en_result_t enIrqRegistration(const stc_irq_regi_conf_t *pstcIrqRegiConf)
{
    // todo, assert ...
    stc_intc_sel_field_t *stcIntSel;
    en_result_t enRet = Ok;

    //DDL_ASSERT(NULL != pstcIrqRegiConf->pfnCallback);
    DDL_ASSERT(IS_NULL_POINT(pstcIrqRegiConf->pfnCallback));

    /* IRQ032~127 whether out of range */
    if (((((pstcIrqRegiConf->enIntSrc/32)*6 + 32) > pstcIrqRegiConf->enIRQn) || \
        (((pstcIrqRegiConf->enIntSrc/32)*6 + 37) < pstcIrqRegiConf->enIRQn)) && \
        (pstcIrqRegiConf->enIRQn >= 32))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcIntSel = (stc_intc_sel_field_t *)((uint32_t)(&M4_INTC->SEL0)         +   \
                                             (4u * pstcIrqRegiConf->enIRQn));
        if (0x1FFu == stcIntSel->INTSEL)
        {
            stcIntSel->INTSEL = pstcIrqRegiConf->enIntSrc;
            IrqHandler[pstcIrqRegiConf->enIRQn] = pstcIrqRegiConf->pfnCallback;
        }
        else
        {
            enRet = ErrorUninitialized;
        }
    }
    return enRet;
}
/**
 * @brief  Get specified External interrupt trigger source
 * @param  [in] u32ExIntCh: External interrupt channel, @ref EXINT_Channel_Sel for details
 *   @arg  EXINT_CH00
 *   @arg  EXINT_CH01
 *   @arg  EXINT_CH02
 *   @arg  EXINT_CH03
 *   @arg  EXINT_CH04
 *   @arg  EXINT_CH05
 *   @arg  EXINT_CH06
 *   @arg  EXINT_CH07
 *   @arg  EXINT_CH08
 *   @arg  EXINT_CH09
 *   @arg  EXINT_CH10
 *   @arg  EXINT_CH11
 *   @arg  EXINT_CH12
 *   @arg  EXINT_CH13
 *   @arg  EXINT_CH14
 *   @arg  EXINT_CH15
 * @retval Set: Specified channel of external interrupt is triggered
 *         Reset: Specified channel of external interrupt is not triggered
 */
en_flag_status_t EXINT_GetExIntSrc(uint32_t u32ExIntCh)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_EXINT_CH(u32ExIntCh));

    return ((READ_REG16(M4_INTC->EIFR) & u32ExIntCh) != 0U) ? Set : Reset;
}
/**
 * @brief  Clear specified External interrupt trigger source
 * @param  [in] u32ExIntCh: External interrupt channel, @ref EXINT_Channel_Sel for details
 *   @arg  EXINT_CH00
 *   @arg  EXINT_CH01
 *   @arg  EXINT_CH02
 *   @arg  EXINT_CH03
 *   @arg  EXINT_CH04
 *   @arg  EXINT_CH05
 *   @arg  EXINT_CH06
 *   @arg  EXINT_CH07
 *   @arg  EXINT_CH08
 *   @arg  EXINT_CH09
 *   @arg  EXINT_CH10
 *   @arg  EXINT_CH11
 *   @arg  EXINT_CH12
 *   @arg  EXINT_CH13
 *   @arg  EXINT_CH14
 *   @arg  EXINT_CH15
 * @retval None
 */
void EXINT_ClrExIntSrc(uint32_t u32ExIntCh)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_EXINT_CH(u32ExIntCh));

    SET_REG32_BIT(M4_INTC->EICFR, u32ExIntCh);
}
/**
 *******************************************************************************
 ** \brief IRQ Resign
 **
 ** param [in]                          enIRQn, IRQ enumunation (Int000_IRQn ~
 **                                     Int127_IRQn
 **
 ** retval                              Ok, IRQ resign sucessfully.
 **                                     ErrorInvalidParameter, IRQ No. is out
 **                                     of range
 **
 *****************************************************************************/
en_result_t enIrqResign(IRQn_Type enIRQn)
{
    stc_intc_sel_field_t *stcIntSel;
    en_result_t enRet = Ok;

    if ((enIRQn < Int000_IRQn) || (enIRQn > Int127_IRQn))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        stcIntSel = (stc_intc_sel_field_t *)((uint32_t)(&M4_INTC->SEL0) + (4ul * enIRQn));
        stcIntSel->INTSEL = 0x1FFu;
        IrqHandler[enIRQn] = NULL;
    }
    return enRet;
}

/**
 *******************************************************************************
 ** \brief Share IRQ handler enable
 **
 ** param [in]                          enIntSrc, interrupt souce, This parameter
 **                                     can be any value of @ref en_int_src_t
 **
 ** retval                              Ok
 **
 ******************************************************************************/
en_result_t enShareIrqEnable(en_int_src_t enIntSrc)
{
    uint32_t *VSSELx;

