RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_interrupts.c
    //todo assert

    VSSELx = (uint32_t *)(((uint32_t)&M4_INTC->VSSEL128) + (4u * (enIntSrc/32u)));
    *VSSELx |= (uint32_t)(1ul << (enIntSrc & 0x1Fu));

    return Ok;
}

/**
 *******************************************************************************
 ** \brief Share IRQ handler disable
 **
 ** param [in]                          enIntSrc, interrupt souce, This parameter
 **                                     can be any value of @ref en_int_src_t
 **
 ** retval                              Ok
 **
 ******************************************************************************/
en_result_t enShareIrqDisable(en_int_src_t enIntSrc)
{
    uint32_t *VSSELx;

    //todo assert

    VSSELx = (uint32_t *)(((uint32_t)&M4_INTC->VSSEL128) + (4u * (enIntSrc/32u)));
    *VSSELx &= ~(uint32_t)(1ul << (enIntSrc & 0x1Fu));

    return Ok;
}

/**
 *******************************************************************************
 ** \brief Enable stop mode wakeup source
 **
 ** param [in]                          u32WakeupSrc, This parameter can be any
 **                                     composed value of @ref en_int_wkup_src_t
 **
 ** retval                              Ok, corresponding wakeup source be enabled
 **                                     ErrorInvalidParameter, parameter with
 **                                     non-definition bits
 **
 ******************************************************************************/
en_result_t enIntWakeupEnable(uint32_t u32WakeupSrc)
{
    en_result_t enRet = Ok;
    if (0ul != (u32WakeupSrc & 0xFD000000ul))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        M4_INTC->WUPEN |= u32WakeupSrc;
    }
    return enRet;
}

/**
 *******************************************************************************
 ** \brief Disable stop mode wakeup source
 **
 ** param [in]                          u32WakeupSrc, This parameter can be any
 **                                     composed value of @ref en_int_wkup_src_t
 **
 ** retval                              Ok, corresponding wakeup source be disabled
 **                                     ErrorInvalidParameter, parameter with
 **                                     non-definition bits
 **
 ******************************************************************************/
en_result_t enIntWakeupDisable(uint32_t u32WakeupSrc)
{
    en_result_t enRet = Ok;
    if (0ul != (u32WakeupSrc & 0xFD000000u))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        M4_INTC->WUPEN &= ~u32WakeupSrc;
    }
    return enRet;
}

/**
 *******************************************************************************
 ** \brief Event enable
 **
 ** param [in]                          u32Event, This parameter can be
 **                                     any composed value of @ref en_evt_t
 **
 ** retval                              Ok, corresponding event Ch. be enabled
 **
 ******************************************************************************/
en_result_t enEventEnable(uint32_t u32Event)
{
    M4_INTC->EVTER |= u32Event;
    return Ok;
}

/**
 *******************************************************************************
 ** \brief Event enable
 **
 ** param [in]                          u32Event, This parameter can be
 **                                     any composed value of @ref en_evt_t
 **
 ** retval                              Ok, corresponding event Ch. be disabled
 **
 ******************************************************************************/
en_result_t enEventDisable(uint32_t u32Event)
{
    M4_INTC->EVTER &= ~u32Event;
    return Ok;
}

/**
 *******************************************************************************
 ** \brief Interrupt enable
 **
 *  param [in]                          u32Int, This parameter can be any composed
 *                                      value of @ref en_int_t
 **
 ** retval                              Ok, corresponding interrupt vector be enabled
 **
 ******************************************************************************/
en_result_t enIntEnable(uint32_t u32Int)
{
    M4_INTC->IER |= u32Int;
    return Ok;
}

/**
 *******************************************************************************
 ** \brief Interrupt disable
 **
 *  param [in]                          u32Int, This parameter can be any composed
 *                                      value of @ref en_int_t
 **
 ** retval                              Ok, corresponding interrupt vector be disabled
 **
 ******************************************************************************/
en_result_t enIntDisable(uint32_t u32Int)
{
    M4_INTC->IER &= ~u32Int;
    return Ok;
}

/**
 *******************************************************************************
 ** \brief NMI IRQ handler
 **
 ******************************************************************************/
void NMI_Handler(void)
{
    NMI_IrqHandler();
}

/**
 *******************************************************************************
 ** \brief Hard Fault IRQ handler
 **
 ******************************************************************************/
//void HardFault_Handler(void)
//{
//    HardFault_IrqHandler();
//}

/**
 *******************************************************************************
 ** \brief MPU Fault IRQ handler
 **
 ******************************************************************************/
void MemManage_Handler(void)
{
    MemManage_IrqHandler();
}

/**
 *******************************************************************************
 ** \brief Bus Fault IRQ handler
 **
 ******************************************************************************/
void BusFault_Handler(void)
{
    BusFault_IrqHandler();
}

/**
 *******************************************************************************
 ** \brief Usage Fault IRQ handler
 **
 ******************************************************************************/
void UsageFault_Handler(void)
{
    UsageFault_IrqHandler();
}

/**
 *******************************************************************************
 ** \brief SVCall IRQ handler
 **
 ******************************************************************************/
void SVC_Handler(void)
{
    SVC_IrqHandler();
}

/**
 *******************************************************************************
 ** \brief DebugMon IRQ handler
 **
 ******************************************************************************/
void DebugMon_Handler(void)
{
    DebugMon_IrqHandler();
}

/**
 *******************************************************************************
 ** \brief PendSV IRQ handler
 **
 ******************************************************************************/
//void PendSV_Handler(void)
//{
//    PendSV_IrqHandler();
//}

/**
 *******************************************************************************
 ** \brief Systick IRQ handler
 **
 ******************************************************************************/
//void SysTick_Handler(void)
//{
//    SysTick_IrqHandler();
//}

/**
 *******************************************************************************
 ** \brief Int No.000 IRQ handler
 **
 ******************************************************************************/
void IRQ000_Handler(void)
{
    if (NULL != IrqHandler[Int000_IRQn])
    {
        IrqHandler[Int000_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.001 IRQ handler
 **
 ******************************************************************************/
void IRQ001_Handler(void)
{
    if (NULL != IrqHandler[Int001_IRQn])
    {
        IrqHandler[Int001_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.002 IRQ handler
 **
 ******************************************************************************/
void IRQ002_Handler(void)
{
    if (NULL != IrqHandler[Int002_IRQn])
    {
        IrqHandler[Int002_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.003 IRQ handler
 **
 ******************************************************************************/
void IRQ003_Handler(void)
{
    if (NULL != IrqHandler[Int003_IRQn])
    {
        IrqHandler[Int003_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.004 IRQ handler
 **
 ******************************************************************************/
void IRQ004_Handler(void)
{
    if (NULL != IrqHandler[Int004_IRQn])
    {
        IrqHandler[Int004_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.005 IRQ handler
 **
 ******************************************************************************/
void IRQ005_Handler(void)
{
    if (NULL != IrqHandler[Int005_IRQn])
    {
        IrqHandler[Int005_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.006 IRQ handler
 **
 ******************************************************************************/
void IRQ006_Handler(void)
{
    if (NULL != IrqHandler[Int006_IRQn])
    {
        IrqHandler[Int006_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.007 IRQ handler
 **
 ******************************************************************************/
void IRQ007_Handler(void)
{
    if (NULL != IrqHandler[Int007_IRQn])
    {
        IrqHandler[Int007_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.008 IRQ handler
 **
 ******************************************************************************/
void IRQ008_Handler(void)
{
    if (NULL != IrqHandler[Int008_IRQn])
    {
        IrqHandler[Int008_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.009 IRQ handler
 **
 ******************************************************************************/
void IRQ009_Handler(void)
{
    if (NULL != IrqHandler[Int009_IRQn])
    {
        IrqHandler[Int009_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.010 IRQ handler
 **
 ******************************************************************************/
void IRQ010_Handler(void)
{
    if (NULL != IrqHandler[Int010_IRQn])
    {
        IrqHandler[Int010_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.011 IRQ handler
 **
 ******************************************************************************/
void IRQ011_Handler(void)
{
    if (NULL != IrqHandler[Int011_IRQn])
    {
        IrqHandler[Int011_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.012 IRQ handler
 **
 ******************************************************************************/
void IRQ012_Handler(void)
{
    if (NULL != IrqHandler[Int012_IRQn])
    {
        IrqHandler[Int012_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.013 IRQ handler
 **
 ******************************************************************************/
void IRQ013_Handler(void)
{
    if (NULL != IrqHandler[Int013_IRQn])
    {
        IrqHandler[Int013_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.014 IRQ handler
 **
 ******************************************************************************/
void IRQ014_Handler(void)
{
    if (NULL != IrqHandler[Int014_IRQn])
    {
        IrqHandler[Int014_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.015 IRQ handler
 **
 ******************************************************************************/
void IRQ015_Handler(void)
{
    if (NULL != IrqHandler[Int015_IRQn])
    {
        IrqHandler[Int015_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.016 IRQ handler
 **
 ******************************************************************************/
void IRQ016_Handler(void)
{
    if (NULL != IrqHandler[Int016_IRQn])
    {
        IrqHandler[Int016_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.017 IRQ handler
 **
 ******************************************************************************/
void IRQ017_Handler(void)
{
    if (NULL != IrqHandler[Int017_IRQn])
    {
        IrqHandler[Int017_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.018 IRQ handler
 **
 ******************************************************************************/
void IRQ018_Handler(void)
{
    if (NULL != IrqHandler[Int018_IRQn])
    {
        IrqHandler[Int018_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.019 IRQ handler
 **
 ******************************************************************************/
void IRQ019_Handler(void)
{
    if (NULL != IrqHandler[Int019_IRQn])
    {
        IrqHandler[Int019_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.020 IRQ handler
 **
 ******************************************************************************/
void IRQ020_Handler(void)
{
    if (NULL != IrqHandler[Int020_IRQn])
    {
        IrqHandler[Int020_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.021 IRQ handler
 **
 ******************************************************************************/
void IRQ021_Handler(void)
{
    if (NULL != IrqHandler[Int021_IRQn])
    {
        IrqHandler[Int021_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.022 IRQ handler
 **
 ******************************************************************************/
void IRQ022_Handler(void)
{
    if (NULL != IrqHandler[Int022_IRQn])
    {
        IrqHandler[Int022_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.023 IRQ handler
 **
 ******************************************************************************/
void IRQ023_Handler(void)
{
    if (NULL != IrqHandler[Int023_IRQn])
    {
        IrqHandler[Int023_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.024 IRQ handler
 **
 ******************************************************************************/
void IRQ024_Handler(void)
{
    if (NULL != IrqHandler[Int024_IRQn])
    {
        IrqHandler[Int024_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.025 IRQ handler
 **
 ******************************************************************************/
void IRQ025_Handler(void)
{
    if (NULL != IrqHandler[Int025_IRQn])
    {
        IrqHandler[Int025_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.026 IRQ handler
 **
 ******************************************************************************/
void IRQ026_Handler(void)
{
    if (NULL != IrqHandler[Int026_IRQn])
    {
        IrqHandler[Int026_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.027 IRQ handler
 **
 ******************************************************************************/
void IRQ027_Handler(void)
{
    if (NULL != IrqHandler[Int027_IRQn])
    {
        IrqHandler[Int027_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.028 IRQ handler
 **
 ******************************************************************************/
void IRQ028_Handler(void)
{
    if (NULL != IrqHandler[Int028_IRQn])
    {
        IrqHandler[Int028_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.029 IRQ handler
 **
 ******************************************************************************/
void IRQ029_Handler(void)
{
    if (NULL != IrqHandler[Int029_IRQn])
    {
        IrqHandler[Int029_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.030 IRQ handler
 **
 ******************************************************************************/
void IRQ030_Handler(void)
{
    if (NULL != IrqHandler[Int030_IRQn])
    {
        IrqHandler[Int030_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.031 IRQ handler
 **
 ******************************************************************************/
void IRQ031_Handler(void)
{
    if (NULL != IrqHandler[Int031_IRQn])
    {
        IrqHandler[Int031_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.032 IRQ handler
 **
 ******************************************************************************/
void IRQ032_Handler(void)
{
    if (NULL != IrqHandler[Int032_IRQn])
    {
        IrqHandler[Int032_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.033 IRQ handler
 **
 ******************************************************************************/
void IRQ033_Handler(void)
{
    if (NULL != IrqHandler[Int033_IRQn])
    {
        IrqHandler[Int033_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.034 IRQ handler
 **
 ******************************************************************************/
void IRQ034_Handler(void)
{
    if (NULL != IrqHandler[Int034_IRQn])
    {
        IrqHandler[Int034_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.035 IRQ handler
 **
 ******************************************************************************/
void IRQ035_Handler(void)
{
    if (NULL != IrqHandler[Int035_IRQn])
    {
        IrqHandler[Int035_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.036 IRQ handler
 **
 ******************************************************************************/
void IRQ036_Handler(void)
{
    if (NULL != IrqHandler[Int036_IRQn])
    {
        IrqHandler[Int036_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.037 IRQ handler
 **
 ******************************************************************************/
void IRQ037_Handler(void)
{
    if (NULL != IrqHandler[Int037_IRQn])
    {
        IrqHandler[Int037_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.038 IRQ handler
 **
 ******************************************************************************/
void IRQ038_Handler(void)
{
    if (NULL != IrqHandler[Int038_IRQn])
    {
        IrqHandler[Int038_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.039 IRQ handler
 **
 ******************************************************************************/
void IRQ039_Handler(void)
{
    if (NULL != IrqHandler[Int039_IRQn])
    {
        IrqHandler[Int039_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.040 IRQ handler
 **
 ******************************************************************************/
void IRQ040_Handler(void)
{
    if (NULL != IrqHandler[Int040_IRQn])
    {
        IrqHandler[Int040_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.041 IRQ handler
 **
 ******************************************************************************/
void IRQ041_Handler(void)
{
    if (NULL != IrqHandler[Int041_IRQn])
    {
        IrqHandler[Int041_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.042 IRQ handler
 **
 ******************************************************************************/
void IRQ042_Handler(void)
{
    if (NULL != IrqHandler[Int042_IRQn])
    {
        IrqHandler[Int042_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.043 IRQ handler
 **
 ******************************************************************************/
void IRQ043_Handler(void)
{
    if (NULL != IrqHandler[Int043_IRQn])
    {
        IrqHandler[Int043_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.044 IRQ handler
 **
 ******************************************************************************/
void IRQ044_Handler(void)
{
    if (NULL != IrqHandler[Int044_IRQn])
    {
        IrqHandler[Int044_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.045 IRQ handler
 **
 ******************************************************************************/
void IRQ045_Handler(void)
{
    if (NULL != IrqHandler[Int045_IRQn])
    {
        IrqHandler[Int045_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.046 IRQ handler
 **
 ******************************************************************************/
void IRQ046_Handler(void)
{
    if (NULL != IrqHandler[Int046_IRQn])
    {
        IrqHandler[Int046_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.047 IRQ handler
 **
 ******************************************************************************/
void IRQ047_Handler(void)
{
    if (NULL != IrqHandler[Int047_IRQn])
    {
        IrqHandler[Int047_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.048 IRQ handler
 **
 ******************************************************************************/
void IRQ048_Handler(void)
{
    if (NULL != IrqHandler[Int048_IRQn])
    {
        IrqHandler[Int048_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.049 IRQ handler
 **
 ******************************************************************************/
void IRQ049_Handler(void)
{
    if (NULL != IrqHandler[Int049_IRQn])
    {
        IrqHandler[Int049_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.050 IRQ handler
 **
 ******************************************************************************/
void IRQ050_Handler(void)
{
    if (NULL != IrqHandler[Int050_IRQn])
    {
        IrqHandler[Int050_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.051 IRQ handler
 **
 ******************************************************************************/
void IRQ051_Handler(void)
{
    if (NULL != IrqHandler[Int051_IRQn])
    {
        IrqHandler[Int051_IRQn]();
    }
}

