RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_interrupts.c
/**
 *******************************************************************************
 ** \brief Int No.052 IRQ handler
 **
 ******************************************************************************/
void IRQ052_Handler(void)
{
    if (NULL != IrqHandler[Int052_IRQn])
    {
        IrqHandler[Int052_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.053 IRQ handler
 **
 ******************************************************************************/
void IRQ053_Handler(void)
{
    if (NULL != IrqHandler[Int053_IRQn])
    {
        IrqHandler[Int053_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.054 IRQ handler
 **
 ******************************************************************************/
void IRQ054_Handler(void)
{
    if (NULL != IrqHandler[Int054_IRQn])
    {
        IrqHandler[Int054_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.055 IRQ handler
 **
 ******************************************************************************/
void IRQ055_Handler(void)
{
    if (NULL != IrqHandler[Int055_IRQn])
    {
        IrqHandler[Int055_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.056 IRQ handler
 **
 ******************************************************************************/
void IRQ056_Handler(void)
{
    if (NULL != IrqHandler[Int056_IRQn])
    {
        IrqHandler[Int056_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.057 IRQ handler
 **
 ******************************************************************************/
void IRQ057_Handler(void)
{
    if (NULL != IrqHandler[Int057_IRQn])
    {
        IrqHandler[Int057_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.058 IRQ handler
 **
 ******************************************************************************/
void IRQ058_Handler(void)
{
    if (NULL != IrqHandler[Int058_IRQn])
    {
        IrqHandler[Int058_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.059 IRQ handler
 **
 ******************************************************************************/
void IRQ059_Handler(void)
{
    if (NULL != IrqHandler[Int059_IRQn])
    {
        IrqHandler[Int059_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.060 IRQ handler
 **
 ******************************************************************************/
void IRQ060_Handler(void)
{
    if (NULL != IrqHandler[Int060_IRQn])
    {
        IrqHandler[Int060_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.061 IRQ handler
 **
 ******************************************************************************/
void IRQ061_Handler(void)
{
    if (NULL != IrqHandler[Int061_IRQn])
    {
        IrqHandler[Int061_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.062 IRQ handler
 **
 ******************************************************************************/
void IRQ062_Handler(void)
{
    if (NULL != IrqHandler[Int062_IRQn])
    {
        IrqHandler[Int062_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.063 IRQ handler
 **
 ******************************************************************************/
void IRQ063_Handler(void)
{
    if (NULL != IrqHandler[Int063_IRQn])
    {
        IrqHandler[Int063_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.064 IRQ handler
 **
 ******************************************************************************/
void IRQ064_Handler(void)
{
    if (NULL != IrqHandler[Int064_IRQn])
    {
        IrqHandler[Int064_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.065 IRQ handler
 **
 ******************************************************************************/
void IRQ065_Handler(void)
{
    if (NULL != IrqHandler[Int065_IRQn])
    {
        IrqHandler[Int065_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.066 IRQ handler
 **
 ******************************************************************************/
void IRQ066_Handler(void)
{
    if (NULL != IrqHandler[Int066_IRQn])
    {
        IrqHandler[Int066_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.067 IRQ handler
 **
 ******************************************************************************/
void IRQ067_Handler(void)
{
    if (NULL != IrqHandler[Int067_IRQn])
    {
        IrqHandler[Int067_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.068 IRQ handler
 **
 ******************************************************************************/
void IRQ068_Handler(void)
{
    if (NULL != IrqHandler[Int068_IRQn])
    {
        IrqHandler[Int068_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.069 IRQ handler
 **
 ******************************************************************************/
void IRQ069_Handler(void)
{
    if (NULL != IrqHandler[Int069_IRQn])
    {
        IrqHandler[Int069_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.070 IRQ handler
 **
 ******************************************************************************/
void IRQ070_Handler(void)
{
    if (NULL != IrqHandler[Int070_IRQn])
    {
        IrqHandler[Int070_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.071 IRQ handler
 **
 ******************************************************************************/
void IRQ071_Handler(void)
{
    if (NULL != IrqHandler[Int071_IRQn])
    {
        IrqHandler[Int071_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.072 IRQ handler
 **
 ******************************************************************************/
void IRQ072_Handler(void)
{
    if (NULL != IrqHandler[Int072_IRQn])
    {
        IrqHandler[Int072_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.073 IRQ handler
 **
 ******************************************************************************/
void IRQ073_Handler(void)
{
    if (NULL != IrqHandler[Int073_IRQn])
    {
        IrqHandler[Int073_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.074 IRQ handler
 **
 ******************************************************************************/
void IRQ074_Handler(void)
{
    if (NULL != IrqHandler[Int074_IRQn])
    {
        IrqHandler[Int074_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.075 IRQ handler
 **
 ******************************************************************************/
void IRQ075_Handler(void)
{
    if (NULL != IrqHandler[Int075_IRQn])
    {
        IrqHandler[Int075_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.076 IRQ handler
 **
 ******************************************************************************/
void IRQ076_Handler(void)
{
    if (NULL != IrqHandler[Int076_IRQn])
    {
        IrqHandler[Int076_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.077 IRQ handler
 **
 ******************************************************************************/
void IRQ077_Handler(void)
{
    if (NULL != IrqHandler[Int077_IRQn])
    {
        IrqHandler[Int077_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.078 IRQ handler
 **
 ******************************************************************************/
void IRQ078_Handler(void)
{
    if (NULL != IrqHandler[Int078_IRQn])
    {
        IrqHandler[Int078_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.079 IRQ handler
 **
 ******************************************************************************/
void IRQ079_Handler(void)
{
    if (NULL != IrqHandler[Int079_IRQn])
    {
        IrqHandler[Int079_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.080 IRQ handler
 **
 ******************************************************************************/
void IRQ080_Handler(void)
{
    if (NULL != IrqHandler[Int080_IRQn])
    {
        IrqHandler[Int080_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.081 IRQ handler
 **
 ******************************************************************************/
void IRQ081_Handler(void)
{
    if (NULL != IrqHandler[Int081_IRQn])
    {
        IrqHandler[Int081_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.082 IRQ handler
 **
 ******************************************************************************/
void IRQ082_Handler(void)
{
    if (NULL != IrqHandler[Int082_IRQn])
    {
        IrqHandler[Int082_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.083 IRQ handler
 **
 ******************************************************************************/
void IRQ083_Handler(void)
{
    if (NULL != IrqHandler[Int083_IRQn])
    {
        IrqHandler[Int083_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.084 IRQ handler
 **
 ******************************************************************************/
void IRQ084_Handler(void)
{
    if (NULL != IrqHandler[Int084_IRQn])
    {
        IrqHandler[Int084_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.085 IRQ handler
 **
 ******************************************************************************/
void IRQ085_Handler(void)
{
    if (NULL != IrqHandler[Int085_IRQn])
    {
        IrqHandler[Int085_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.086 IRQ handler
 **
 ******************************************************************************/
void IRQ086_Handler(void)
{
    if (NULL != IrqHandler[Int086_IRQn])
    {
        IrqHandler[Int086_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.087 IRQ handler
 **
 ******************************************************************************/
void IRQ087_Handler(void)
{
    if (NULL != IrqHandler[Int087_IRQn])
    {
        IrqHandler[Int087_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.088 IRQ handler
 **
 ******************************************************************************/
void IRQ088_Handler(void)
{
    if (NULL != IrqHandler[Int088_IRQn])
    {
        IrqHandler[Int088_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.089 IRQ handler
 **
 ******************************************************************************/
void IRQ089_Handler(void)
{
    if (NULL != IrqHandler[Int089_IRQn])
    {
        IrqHandler[Int089_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.090 IRQ handler
 **
 ******************************************************************************/
void IRQ090_Handler(void)
{
    if (NULL != IrqHandler[Int090_IRQn])
    {
        IrqHandler[Int090_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.091 IRQ handler
 **
 ******************************************************************************/
void IRQ091_Handler(void)
{
    if (NULL != IrqHandler[Int091_IRQn])
    {
        IrqHandler[Int091_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.092 IRQ handler
 **
 ******************************************************************************/
void IRQ092_Handler(void)
{
    if (NULL != IrqHandler[Int092_IRQn])
    {
        IrqHandler[Int092_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.093 IRQ handler
 **
 ******************************************************************************/
void IRQ093_Handler(void)
{
    if (NULL != IrqHandler[Int093_IRQn])
    {
        IrqHandler[Int093_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.094 IRQ handler
 **
 ******************************************************************************/
void IRQ094_Handler(void)
{
    if (NULL != IrqHandler[Int094_IRQn])
    {
        IrqHandler[Int094_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.095 IRQ handler
 **
 ******************************************************************************/
void IRQ095_Handler(void)
{
    if (NULL != IrqHandler[Int095_IRQn])
    {
        IrqHandler[Int095_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.096 IRQ handler
 **
 ******************************************************************************/
void IRQ096_Handler(void)
{
    if (NULL != IrqHandler[Int096_IRQn])
    {
        IrqHandler[Int096_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.097 IRQ handler
 **
 ******************************************************************************/
void IRQ097_Handler(void)
{
    if (NULL != IrqHandler[Int097_IRQn])
    {
        IrqHandler[Int097_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.098 IRQ handler
 **
 ******************************************************************************/
void IRQ098_Handler(void)
{
    if (NULL != IrqHandler[Int098_IRQn])
    {
        IrqHandler[Int098_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.099 IRQ handler
 **
 ******************************************************************************/
void IRQ099_Handler(void)
{
    if (NULL != IrqHandler[Int099_IRQn])
    {
        IrqHandler[Int099_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.100 IRQ handler
 **
 ******************************************************************************/
void IRQ100_Handler(void)
{
    if (NULL != IrqHandler[Int100_IRQn])
    {
        IrqHandler[Int100_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.101 IRQ handler
 **
 ******************************************************************************/
void IRQ101_Handler(void)
{
    if (NULL != IrqHandler[Int101_IRQn])
    {
        IrqHandler[Int101_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.102 IRQ handler
 **
 ******************************************************************************/
void IRQ102_Handler(void)
{
    if (NULL != IrqHandler[Int102_IRQn])
    {
        IrqHandler[Int102_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.103 IRQ handler
 **
 ******************************************************************************/
void IRQ103_Handler(void)
{
    if (NULL != IrqHandler[Int103_IRQn])
    {
        IrqHandler[Int103_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.104 IRQ handler
 **
 ******************************************************************************/
void IRQ104_Handler(void)
{
    if (NULL != IrqHandler[Int104_IRQn])
    {
        IrqHandler[Int104_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.105 IRQ handler
 **
 ******************************************************************************/
void IRQ105_Handler(void)
{
    if (NULL != IrqHandler[Int105_IRQn])
    {
        IrqHandler[Int105_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.106 IRQ handler
 **
 ******************************************************************************/
void IRQ106_Handler(void)
{
    if (NULL != IrqHandler[Int106_IRQn])
    {
        IrqHandler[Int106_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.107 IRQ handler
 **
 ******************************************************************************/
void IRQ107_Handler(void)
{
    if (NULL != IrqHandler[Int107_IRQn])
    {
        IrqHandler[Int107_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.108 IRQ handler
 **
 ******************************************************************************/
void IRQ108_Handler(void)
{
    if (NULL != IrqHandler[Int108_IRQn])
    {
        IrqHandler[Int108_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.109 IRQ handler
 **
 ******************************************************************************/
void IRQ109_Handler(void)
{
    if (NULL != IrqHandler[Int109_IRQn])
    {
        IrqHandler[Int109_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.110 IRQ handler
 **
 ******************************************************************************/
void IRQ110_Handler(void)
{
    if (NULL != IrqHandler[Int110_IRQn])
    {
        IrqHandler[Int110_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.111 IRQ handler
 **
 ******************************************************************************/
void IRQ111_Handler(void)
{
    if (NULL != IrqHandler[Int111_IRQn])
    {
        IrqHandler[Int111_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.112 IRQ handler
 **
 ******************************************************************************/
void IRQ112_Handler(void)
{
    if (NULL != IrqHandler[Int112_IRQn])
    {
        IrqHandler[Int112_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.113 IRQ handler
 **
 ******************************************************************************/
void IRQ113_Handler(void)
{
    if (NULL != IrqHandler[Int113_IRQn])
    {
        IrqHandler[Int113_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.114 IRQ handler
 **
 ******************************************************************************/
void IRQ114_Handler(void)
{
    if (NULL != IrqHandler[Int114_IRQn])
    {
        IrqHandler[Int114_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.115 IRQ handler
 **
 ******************************************************************************/
void IRQ115_Handler(void)
{
    if (NULL != IrqHandler[Int115_IRQn])
    {
        IrqHandler[Int115_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.116 IRQ handler
 **
 ******************************************************************************/
void IRQ116_Handler(void)
{
    if (NULL != IrqHandler[Int116_IRQn])
    {
        IrqHandler[Int116_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.117 IRQ handler
 **
 ******************************************************************************/
void IRQ117_Handler(void)
{
    if (NULL != IrqHandler[Int117_IRQn])
    {
        IrqHandler[Int117_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.118 IRQ handler
 **
 ******************************************************************************/
void IRQ118_Handler(void)
{
    if (NULL != IrqHandler[Int118_IRQn])
    {
        IrqHandler[Int118_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.119 IRQ handler
 **
 ******************************************************************************/
void IRQ119_Handler(void)
{
    if (NULL != IrqHandler[Int119_IRQn])
    {
        IrqHandler[Int119_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.120 IRQ handler
 **
 ******************************************************************************/
void IRQ120_Handler(void)
{
    if (NULL != IrqHandler[Int120_IRQn])
    {
        IrqHandler[Int120_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.121 IRQ handler
 **
 ******************************************************************************/
void IRQ121_Handler(void)
{
    if (NULL != IrqHandler[Int121_IRQn])
    {
        IrqHandler[Int121_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.122 IRQ handler
 **
 ******************************************************************************/
void IRQ122_Handler(void)
{
    if (NULL != IrqHandler[Int122_IRQn])
    {
        IrqHandler[Int122_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.123 IRQ handler
 **
 ******************************************************************************/
void IRQ123_Handler(void)
{
    if (NULL != IrqHandler[Int123_IRQn])
    {
        IrqHandler[Int123_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.124 IRQ handler
 **
 ******************************************************************************/
void IRQ124_Handler(void)
{
    if (NULL != IrqHandler[Int124_IRQn])
    {
        IrqHandler[Int124_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.125 IRQ handler
 **
 ******************************************************************************/
void IRQ125_Handler(void)
{
    if (NULL != IrqHandler[Int125_IRQn])
    {
        IrqHandler[Int125_IRQn]();
    }
}

