RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_interrupts.c
/**
 *******************************************************************************
 ** \brief Int No.126 IRQ handler
 **
 ******************************************************************************/
void IRQ126_Handler(void)
{
    if (NULL != IrqHandler[Int126_IRQn])
    {
        IrqHandler[Int126_IRQn]();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.127 IRQ handler
 **
 ******************************************************************************/
void IRQ127_Handler(void)
{
    if (NULL != IrqHandler[Int127_IRQn])
    {
        IrqHandler[Int127_IRQn]();
    }
}

#if (DDL_INTERRUPTS_SHARE_ENABLE == DDL_ON)
/**
 *******************************************************************************
 ** \brief Int No.128 share IRQ handler
 **
 ******************************************************************************/
void IRQ128_Handler(void)
{
    uint32_t VSSEL128 = M4_INTC->VSSEL128;

    /* external interrupt 00 */
    if ((1ul == bM4_INTC_EIFR_EIFR0) && (VSSEL128 & BIT_MASK_00))
    {
        Extint00_IrqHandler();
    }
    /* external interrupt 01 */
    if ((1ul == bM4_INTC_EIFR_EIFR1) && (VSSEL128 & BIT_MASK_01))
    {
        Extint01_IrqHandler();
    }
    /* external interrupt 02 */
    if ((1ul == bM4_INTC_EIFR_EIFR2) && (VSSEL128 & BIT_MASK_02))
    {
        Extint02_IrqHandler();
    }
    /* external interrupt 03 */
    if ((1ul == bM4_INTC_EIFR_EIFR3) && (VSSEL128 & BIT_MASK_03))
    {
        Extint03_IrqHandler();
    }
    /* external interrupt 04 */
    if ((1ul == bM4_INTC_EIFR_EIFR4) && (VSSEL128 & BIT_MASK_04))
    {
        Extint04_IrqHandler();
    }
    /* external interrupt 05 */
    if ((1ul == bM4_INTC_EIFR_EIFR5) && (VSSEL128 & BIT_MASK_05))
    {
        Extint05_IrqHandler();
    }
    /* external interrupt 06 */
    if ((1ul == bM4_INTC_EIFR_EIFR6) && (VSSEL128 & BIT_MASK_06))
    {
        Extint06_IrqHandler();
    }
    /* external interrupt 07 */
    if ((1ul == bM4_INTC_EIFR_EIFR7) && (VSSEL128 & BIT_MASK_07))
    {
        Extint07_IrqHandler();
    }
    /* external interrupt 08 */
    if ((1ul == bM4_INTC_EIFR_EIFR8) && (VSSEL128 & BIT_MASK_08))
    {
        Extint08_IrqHandler();
    }
    /* external interrupt 09 */
    if ((1ul == bM4_INTC_EIFR_EIFR9) && (VSSEL128 & BIT_MASK_09))
    {
        Extint09_IrqHandler();
    }
    /* external interrupt 10 */
    if ((1ul == bM4_INTC_EIFR_EIFR10) && (VSSEL128 & BIT_MASK_10))
    {
        Extint10_IrqHandler();
    }
    /* external interrupt 11 */
    if ((1ul == bM4_INTC_EIFR_EIFR11) && (VSSEL128 & BIT_MASK_11))
    {
        Extint11_IrqHandler();
    }
    /* external interrupt 12 */
    if ((1ul == bM4_INTC_EIFR_EIFR12) && (VSSEL128 & BIT_MASK_12))
    {
        Extint12_IrqHandler();
    }
    /* external interrupt 13 */
    if ((1ul == bM4_INTC_EIFR_EIFR13) && (VSSEL128 & BIT_MASK_13))
    {
        Extint13_IrqHandler();
    }
    /* external interrupt 14 */
    if ((1ul == bM4_INTC_EIFR_EIFR14) && (VSSEL128 & BIT_MASK_14))
    {
        Extint14_IrqHandler();
    }
    /* external interrupt 15 */
    if ((1ul == bM4_INTC_EIFR_EIFR15) && (VSSEL128 & BIT_MASK_15))
    {
        Extint15_IrqHandler();
    }
}


/**
 *******************************************************************************
 ** \brief Int No.129 share IRQ handler
 **
 ******************************************************************************/
void IRQ129_Handler(void)
{
    uint32_t VSSEL129 =M4_INTC->VSSEL129;
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;

    if (1ul == bM4_DMA1_CH0CTL_IE)
    {
        /* DMA1 ch.0 Tx completed */
        if (0ul == bM4_DMA1_INTMASK1_MSKTC0)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_TC0) && (VSSEL129 & BIT_MASK_00))
            {
                Dma1Tc0_IrqHandler();
            }
        }
        /* DMA1 ch.0 Block Tx completed */
        if (0ul == bM4_DMA1_INTMASK1_MSKBTC0)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_BTC0) && (VSSEL129 & BIT_MASK_08))
            {
                Dma1Btc0_IrqHandler();
            }
        }
        /* DMA1 ch.0 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & 0x00010001ul;
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & 0x00010001ul);
        if ((u32Tmp1 & u32Tmp2) && (VSSEL129 & BIT_MASK_16))
        {
            Dma1Err0_IrqHandler();
        }
    }
    if (1ul == bM4_DMA1_CH1CTL_IE)
    {
        /* DMA1 ch.1 Tx completed */
        if (0ul == bM4_DMA1_INTMASK1_MSKTC1)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_TC1)  && (VSSEL129 & BIT_MASK_01))
            {
                Dma1Tc1_IrqHandler();
            }
        }
        /* DMA1 ch.1 Block Tx completed */
        if (0ul == bM4_DMA1_INTMASK1_MSKBTC1)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_BTC1) && (VSSEL129 & BIT_MASK_09))
            {
                Dma1Btc1_IrqHandler();
            }
        }
        /* DMA1 ch.1 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & 0x00020002ul;
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & 0x00020002ul);
        if ((u32Tmp1 & u32Tmp2) && (VSSEL129 & BIT_MASK_16))
        {
            Dma1Err1_IrqHandler();
        }
    }
    if (1ul == bM4_DMA1_CH2CTL_IE)
    {
        /* DMA1 ch.2 Tx completed */
        if (0ul == bM4_DMA1_INTMASK1_MSKTC2)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_TC2)  && (VSSEL129 & BIT_MASK_02))
            {
                Dma1Tc2_IrqHandler();
            }
        }
        /* DMA1 ch.2 Block Tx completed */
        if (0ul == bM4_DMA1_INTMASK1_MSKBTC2)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_BTC2) && (VSSEL129 & BIT_MASK_10))
            {
                Dma1Btc2_IrqHandler();
            }
        }
        /* DMA1 ch.2 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & 0x00040004ul;
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & 0x00040004ul);
        if ((u32Tmp1 & u32Tmp2) && (VSSEL129 & BIT_MASK_16))
        {
            Dma1Err2_IrqHandler();
        }
    }
    if (1ul == bM4_DMA1_CH3CTL_IE)
    {
        /* DMA1 ch.3 Tx completed */
        if (0ul == bM4_DMA1_INTMASK1_MSKTC3)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_TC3)  && (VSSEL129 & BIT_MASK_03))
            {
                Dma1Tc3_IrqHandler();
            }
        }
        /* DMA1 ch.3 Block Tx completed */
        if (0ul == bM4_DMA1_INTMASK1_MSKBTC3)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_BTC3) && (VSSEL129 & BIT_MASK_11))
            {
                Dma1Btc3_IrqHandler();
            }
        }
        /* DMA1 ch.3 Transfer/Request Error */
        u32Tmp1 = M4_DMA1->INTSTAT0 & 0x00080008ul;
        u32Tmp2 = (uint32_t)(~(M4_DMA1->INTMASK0) & 0x00080008ul);
        if ((u32Tmp1 & u32Tmp2) && (VSSEL129 & BIT_MASK_16))
        {
            Dma1Err3_IrqHandler();
        }
    }
    if (1ul == bM4_DMA2_CH0CTL_IE)
    {
        /* DMA2 ch.0 Tx completed */
        if (0ul == bM4_DMA2_INTMASK1_MSKTC0)
        {
            if ((1ul == bM4_DMA2_INTSTAT1_TC0) && (VSSEL129 & BIT_MASK_04))
            {
                Dma2Tc0_IrqHandler();
            }
        }
        /* DMA2 ch.0 Block Tx completed */
        if (0ul == bM4_DMA2_INTMASK1_MSKBTC0)
        {
            if ((1ul == bM4_DMA2_INTSTAT1_BTC0) && (VSSEL129 & BIT_MASK_12))
            {
                Dma2Btc0_IrqHandler();
            }
        }
        /* DMA2 Ch.0 Transfer/Request Error */
        u32Tmp1 = M4_DMA2->INTSTAT0 & 0x00010001ul;
        u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & 0x00010001ul);
        if ((u32Tmp1 & u32Tmp2) && (VSSEL129 & BIT_MASK_17))
        {
            Dma2Err0_IrqHandler();
        }
    }
    if (1ul == bM4_DMA2_CH1CTL_IE)
    {
        /* DMA2 ch.1 Tx completed */
        if (0ul == bM4_DMA2_INTMASK1_MSKTC1)
        {
            if ((1ul == bM4_DMA2_INTSTAT1_TC1) && (VSSEL129 & BIT_MASK_05))
            {
                Dma2Tc1_IrqHandler();
            }
        }
        /* DMA2 ch.1 Block Tx completed */
        if (0ul == bM4_DMA2_INTMASK1_MSKBTC1)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_BTC1) && (VSSEL129 & BIT_MASK_13))
            {
                Dma2Btc1_IrqHandler();
            }
        }
        /* DMA2 Ch.1 Transfer/Request Error */
        u32Tmp1 = M4_DMA2->INTSTAT0 & 0x00020002ul;
        u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & 0x00020002ul);
        if ((u32Tmp1 & u32Tmp2) && (VSSEL129 & BIT_MASK_17))
        {
            Dma2Err1_IrqHandler();
        }
    }
    if (1ul == bM4_DMA2_CH2CTL_IE)
    {
        /* DMA2 ch.2 Tx completed */
        if (0ul == bM4_DMA2_INTMASK1_MSKTC2)
        {
            if ((1ul == bM4_DMA2_INTSTAT1_TC2) && (VSSEL129 & BIT_MASK_06))
            {
                Dma2Tc2_IrqHandler();
            }
        }
        /* DMA2 ch.2 Block Tx completed */
        if (0ul == bM4_DMA2_INTMASK1_MSKBTC2)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_BTC2) && (VSSEL129 & BIT_MASK_14))
            {
                Dma2Btc2_IrqHandler();
            }
        }
        /* DMA2 Ch.2 Transfer/Request Error */
        u32Tmp1 = M4_DMA2->INTSTAT0 & 0x00040004ul;
        u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & 0x00040004ul);
        if ((u32Tmp1 & u32Tmp2) && (VSSEL129 & BIT_MASK_17))
        {
            Dma2Err2_IrqHandler();
        }
    }
    if (1ul == bM4_DMA2_CH3CTL_IE)
    {
        /* DMA2 ch.3 Tx completed */
        if (0ul == bM4_DMA2_INTMASK1_MSKTC3)
        {
            if ((1ul == bM4_DMA2_INTSTAT1_TC3) && (VSSEL129 & BIT_MASK_07))
            {
                Dma2Tc3_IrqHandler();
            }
        }
        /* DMA2 ch.3 Block Tx completed */
        if (0ul == bM4_DMA2_INTMASK1_MSKBTC3)
        {
            if ((1ul == bM4_DMA1_INTSTAT1_BTC3) && (VSSEL129 & BIT_MASK_15))
            {
                Dma2Btc3_IrqHandler();
            }
        }
        /* DMA2 Ch.3 Transfer/Request Error */
        u32Tmp1 = M4_DMA2->INTSTAT0 & 0x00080008ul;
        u32Tmp2 = (uint32_t)(~(M4_DMA2->INTMASK0) & 0x00080008ul);
        if ((u32Tmp1 & u32Tmp2) && (VSSEL129 & BIT_MASK_17))
        {
            Dma2Err3_IrqHandler();
        }
    }
    /* EFM program/erase Error */
    if (1ul == bM4_EFM_FITE_PEERRITE)
    {
        if ((M4_EFM->FSR & 0x0Fu) && (VSSEL129 & BIT_MASK_18))
        {
            EfmPgmEraseErr_IrqHandler();
        }
    }
    /* EFM collision Error */
    if (1ul == bM4_EFM_FITE_COLERRITE)
    {
        if ((1ul == bM4_EFM_FSR_COLERR) && (VSSEL129 & BIT_MASK_19))
        {
            EfmColErr_IrqHandler();
        }
    }
    /* EFM operate end */
    if (1ul == bM4_EFM_FITE_OPTENDITE)
    {
        if ((1ul == bM4_EFM_FSR_OPTEND) && (VSSEL129 & BIT_MASK_20))
        {
            EfmOpEnd_IrqHandler();
        }
    }
    /* QSPI interrupt */
    if ((1ul == M4_QSPI->SR_f.RAER) && (VSSEL129 & BIT_MASK_22))
    {
        QspiInt_IrqHandler();
    }
    /* DCU ch.1 */
    u32Tmp1 = M4_DCU1->INTSEL;
    u32Tmp2 = M4_DCU1->FLAG;
    if ((u32Tmp1 & u32Tmp2 & 0x7Ful) && (VSSEL129 & BIT_MASK_23))
    {
        Dcu1_IrqHandler();
    }
    /* DCU ch.2 */
    u32Tmp1 = M4_DCU2->INTSEL;
    u32Tmp2 = M4_DCU2->FLAG;
    if ((u32Tmp1 & u32Tmp2 & 0x7Ful) && (VSSEL129 & BIT_MASK_24))
    {
        Dcu2_IrqHandler();
    }
    /* DCU ch.3 */
    u32Tmp1 = M4_DCU3->INTSEL;
    u32Tmp2 = M4_DCU3->FLAG;
    if ((u32Tmp1 & u32Tmp2 & 0x7Ful) && (VSSEL129 & BIT_MASK_25))
    {
        Dcu3_IrqHandler();
    }
    /* DCU ch.4 */
    u32Tmp1 = M4_DCU4->INTSEL;
    u32Tmp2 = M4_DCU4->FLAG;
    if ((u32Tmp1 & u32Tmp2 & 0x7Ful) && (VSSEL129 & BIT_MASK_26))
    {
        Dcu4_IrqHandler();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.130 share IRQ handler
 **
 ******************************************************************************/
void IRQ130_Handler(void)
{
    uint32_t VSSEL130 = M4_INTC->VSSEL130;
    /* Timer0 Ch. 1 A compare match */
    if (1ul == bM4_TMR01_BCONR_INTENA)
    {
        if ((1ul == bM4_TMR01_STFLR_CMAF) && (VSSEL130 & BIT_MASK_00))
        {
            Timer01GCMA_IrqHandler();
        }
    }
    /* Timer0 Ch. 1 B compare match */
    if (1ul == bM4_TMR01_BCONR_INTENB)
    {
        if ((1ul == bM4_TMR01_STFLR_CMBF) && (VSSEL130 & BIT_MASK_01))
        {
            Timer01GCMB_IrqHandler();
        }
    }
    /* Timer0 Ch. 2 A compare match */
    if (1ul == bM4_TMR02_BCONR_INTENA)
    {
        if ((1ul == bM4_TMR02_STFLR_CMAF) && (VSSEL130 & BIT_MASK_02))
        {
            Timer02GCMA_IrqHandler();
        }
    }
    /* Timer0 Ch. 2 B compare match */
    if (1ul == bM4_TMR02_BCONR_INTENB)
    {
        if ((1ul == bM4_TMR02_STFLR_CMBF) && (VSSEL130 & BIT_MASK_03))
        {
            Timer02GCMB_IrqHandler();
        }
    }
    /* Main-OSC stop */
    if (1ul == bM4_SYSREG_CMU_XTALSTDCR_XTALSTDIE)
    {
        if ((1ul == bM4_SYSREG_CMU_XTALSTDSR_XTALSTDF) && (VSSEL130 & BIT_MASK_21))
        {
            MainOscStop_IrqHandler();
        }
    }
    /* Wakeup timer */
    if ((1ul == bM4_WKTM_CR_WKOVF) && (VSSEL130 & BIT_MASK_22))
    {
        WakeupTimer_IrqHandler();
    }
    /* SWDT */
    if ((M4_SWDT->SR & (BIT_MASK_16 | BIT_MASK_17)) && (VSSEL130 & BIT_MASK_23))
    {
        Swdt_IrqHandler();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.131 share IRQ handler
 **
 ******************************************************************************/
void IRQ131_Handler(void)
{
    uint32_t VSSEL131 = M4_INTC->VSSEL131;
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    /* Timer6 Ch.1 A compare match */
    if (1ul == bM4_TMR61_ICONR_INTENA)
    {
        if ((1ul == bM4_TMR61_STFLR_CMAF) && (VSSEL131 & BIT_MASK_00))
        {
            Timer61GCMA_IrqHandler();
        }
    }
    /* Timer6 Ch.1 B compare match */
    if (1ul == bM4_TMR61_ICONR_INTENB)
    {
        if ((1ul == bM4_TMR61_STFLR_CMBF) && (VSSEL131 & BIT_MASK_01))
        {
            Timer61GCMB_IrqHandler();
        }
    }
    /* Timer6 Ch.1 C compare match */
    if (1ul == bM4_TMR61_ICONR_INTENC)
    {
        if ((1ul == bM4_TMR61_STFLR_CMCF) && (VSSEL131 & BIT_MASK_02))
        {
            Timer61GCMC_IrqHandler();
        }
    }
    /* Timer6 Ch.1 D compare match */
    if (1ul == bM4_TMR61_ICONR_INTEND)
    {
        if ((1ul == bM4_TMR61_STFLR_CMDF) && (VSSEL131 & BIT_MASK_03))
        {
            Timer61GCMD_IrqHandler();
        }
    }
    /* Timer6 Ch.1 E compare match */
    if (1ul == bM4_TMR61_ICONR_INTENE)
    {
        if ((1ul == bM4_TMR61_STFLR_CMEF) && (VSSEL131 & BIT_MASK_04))
        {
            Timer61GCME_IrqHandler();
        }
    }
    /* Timer6 Ch.1 F compare match */
    if (1ul == bM4_TMR61_ICONR_INTENF)
    {
        if ((1ul == bM4_TMR61_STFLR_CMFF) && (VSSEL131 & BIT_MASK_05))
        {
            Timer61GCMF_IrqHandler();
        }
    }
    /* Timer6 Ch.1 overflow */
    if (1ul == bM4_TMR61_ICONR_INTENOVF)
    {
        if ((1ul == bM4_TMR61_STFLR_OVFF) && (VSSEL131 & BIT_MASK_06))
        {
            Timer61GOV_IrqHandler();
        }
    }
    /* Timer6 Ch.1 underflow */
    if (1ul == bM4_TMR61_ICONR_INTENUDF)
    {
        if ((1ul == bM4_TMR61_STFLR_UDFF) && (VSSEL131 & BIT_MASK_07))
        {
            Timer61GUD_IrqHandler();
        }
    }
    /* Timer6 Ch.1 dead time */
    if (1ul == bM4_TMR61_ICONR_INTENDTE)
    {
        if (((1ul == bM4_TMR61_STFLR_DTEF)) && (VSSEL131 & BIT_MASK_08))
        {
            Timer61GDT_IrqHandler();
        }
    }
    /* Timer6 Ch.1 A up-down compare match */
    u32Tmp1 = (M4_TMR61->ICONR & (BIT_MASK_16 | BIT_MASK_17)) >> 7u;
    u32Tmp2 = M4_TMR61->STFLR & (BIT_MASK_09 | BIT_MASK_10);
    if ((u32Tmp1 & u32Tmp2) && (VSSEL131 & BIT_MASK_11))
    {
        Timer61SCMA_IrqHandler();
    }
    /* Timer6 Ch.1 B up-down compare match */
    u32Tmp1 = (M4_TMR61->ICONR & (BIT_MASK_18 | BIT_MASK_19)) >> 7u;
    u32Tmp2 = M4_TMR61->STFLR & (BIT_MASK_11 | BIT_MASK_12);
    if ((u32Tmp1 & u32Tmp2) && (VSSEL131 & BIT_MASK_12))
    {
        Timer61SCMB_IrqHandler();
    }
    /* Timer6 Ch.2 A compare match */
    if (1ul == bM4_TMR62_ICONR_INTENA)
    {
        if ((1ul == bM4_TMR62_STFLR_CMAF) && (VSSEL131 & BIT_MASK_16))
        {
            Timer62GCMA_IrqHandler();
        }
    }
    /* Timer6 Ch.2 B compare match */
    if (1ul == bM4_TMR62_ICONR_INTENB)
    {
        if ((1ul == bM4_TMR62_STFLR_CMBF) && (VSSEL131 & BIT_MASK_17))
        {
            Timer62GCMB_IrqHandler();
        }
    }
    /* Timer6 Ch.2 C compare match */
    if (1ul == bM4_TMR62_ICONR_INTENC)
    {
        if ((1ul == bM4_TMR62_STFLR_CMCF) && (VSSEL131 & BIT_MASK_18))
        {
            Timer62GCMC_IrqHandler();
        }
    }
    /* Timer6 Ch.2 D compare match */
    if (1ul == bM4_TMR62_ICONR_INTEND)
    {
        if ((1ul == bM4_TMR62_STFLR_CMDF) && (VSSEL131 & BIT_MASK_19))
        {
            Timer62GCMD_IrqHandler();
        }
    }
    /* Timer6 Ch.2 E compare match */
    if (1ul == bM4_TMR62_ICONR_INTENE)
    {
        if ((1ul == bM4_TMR62_STFLR_CMEF) && (VSSEL131 & BIT_MASK_20))
        {
            Timer62GCME_IrqHandler();
        }
    }
    /* Timer6 Ch.2 F compare match */
    if (1ul == bM4_TMR62_ICONR_INTENF)
    {
        if ((1ul == bM4_TMR62_STFLR_CMFF) && (VSSEL131 & BIT_MASK_21))
        {
            Timer62GCMF_IrqHandler();
        }
    }
    /* Timer6 Ch.2 overflow */
    if (1ul == bM4_TMR62_ICONR_INTENOVF)
    {
        if ((1ul == bM4_TMR62_STFLR_OVFF) && (VSSEL131 & BIT_MASK_22))
        {
            Timer62GOV_IrqHandler();
        }
    }
    /* Timer6 Ch.2 underflow */
    if (1ul == bM4_TMR62_ICONR_INTENUDF)
    {
        if ((1ul == bM4_TMR62_STFLR_UDFF) && (VSSEL131 & BIT_MASK_23))
        {
            Timer62GUD_IrqHandler();
        }
    }
    /* Timer6 Ch.2 dead time */
    if (1ul == bM4_TMR62_ICONR_INTENDTE)
    {
        if (((1ul == bM4_TMR62_STFLR_DTEF)) && (VSSEL131 & BIT_MASK_24))
        {
            Timer62GDT_IrqHandler();
        }
    }
    /* Timer6 Ch.2 A up-down compare match */
    u32Tmp1 = (M4_TMR62->ICONR & (BIT_MASK_16 | BIT_MASK_17)) >> 7u;
    u32Tmp2 = M4_TMR62->STFLR & (BIT_MASK_09 | BIT_MASK_10);
    if ((u32Tmp1 & u32Tmp2) && (VSSEL131 & BIT_MASK_27))
    {
        Timer62SCMA_IrqHandler();
    }
    /* Timer6 Ch.2 B up-down compare match */
    u32Tmp1 = (M4_TMR62->ICONR & (BIT_MASK_18 | BIT_MASK_19)) >> 7u;
    u32Tmp2 = M4_TMR62->STFLR & (BIT_MASK_11 | BIT_MASK_12);
    if ((u32Tmp1 & u32Tmp2) && (VSSEL131 & BIT_MASK_28))
    {
        Timer62SCMB_IrqHandler();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.132 share IRQ handler
 **
 ******************************************************************************/
void IRQ132_Handler(void)
{
    uint32_t VSSEL132 = M4_INTC->VSSEL132;
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    /* Timer6 Ch.3 A compare match */
    if (1ul == bM4_TMR63_ICONR_INTENA)
    {
        if ((1ul == bM4_TMR63_STFLR_CMAF) && (VSSEL132 & BIT_MASK_00))
        {
            Timer63GCMA_IrqHandler();
        }
    }
    /* Timer6 Ch.3 B compare match */
    if (1ul == bM4_TMR63_ICONR_INTENB)
    {
        if ((1ul == bM4_TMR63_STFLR_CMBF) && (VSSEL132 & BIT_MASK_01))
        {
            Timer63GCMB_IrqHandler();
        }
    }
    /* Timer6 Ch.3 C compare match */
    if (1ul == bM4_TMR63_ICONR_INTENC)
    {
        if ((1ul == bM4_TMR63_STFLR_CMCF) && (VSSEL132 & BIT_MASK_02))
        {
            Timer63GCMC_IrqHandler();
        }
    }
    /* Timer6 Ch.3 D compare match */
    if (1ul == bM4_TMR63_ICONR_INTEND)
    {
        if ((1ul == bM4_TMR63_STFLR_CMDF) && (VSSEL132 & BIT_MASK_03))
        {
            Timer63GCMD_IrqHandler();
        }
    }
    /* Timer6 Ch.3 E compare match */
    if (1ul == bM4_TMR63_ICONR_INTENE)
    {
        if ((1ul == bM4_TMR63_STFLR_CMEF) && (VSSEL132 & BIT_MASK_04))
        {
            Timer63GCME_IrqHandler();
        }
    }
    /* Timer6 Ch.3 F compare match */
    if (1ul == bM4_TMR63_ICONR_INTENF)
    {
        if ((1ul == bM4_TMR63_STFLR_CMFF) && (VSSEL132 & BIT_MASK_05))
        {
            Timer63GCMF_IrqHandler();
        }
    }
    /* Timer6 Ch.3 overflow */
    if (1ul == bM4_TMR63_ICONR_INTENOVF)
    {
        if ((1ul == bM4_TMR63_STFLR_OVFF) && (VSSEL132 & BIT_MASK_06))
        {
            Timer63GOV_IrqHandler();
        }
    }
    /* Timer6 Ch.3 underflow */
    if (1ul == bM4_TMR63_ICONR_INTENUDF)
    {
        if ((1ul == bM4_TMR63_STFLR_UDFF) && (VSSEL132 & BIT_MASK_07))
        {
            Timer63GUD_IrqHandler();
        }
    }
    /* Timer6 Ch.3 dead time */
    if (1ul == bM4_TMR63_ICONR_INTENDTE)
    {
        if (((1ul == bM4_TMR63_STFLR_DTEF)) && (VSSEL132 & BIT_MASK_08))
        {
            Timer63GDT_IrqHandler();
        }
    }
    /* Timer6 Ch.3 A up-down compare match */
    u32Tmp1 = (M4_TMR63->ICONR & (BIT_MASK_16 | BIT_MASK_17)) >> 7u;
    u32Tmp2 = M4_TMR63->STFLR & (BIT_MASK_09 | BIT_MASK_10);
    if ((u32Tmp1 & u32Tmp2) && (VSSEL132 & BIT_MASK_11))
    {
        Timer63SCMA_IrqHandler();
    }
    /* Timer6 Ch.3 B up-down compare match */
    u32Tmp1 = (M4_TMR63->ICONR & (BIT_MASK_18 | BIT_MASK_19)) >> 7u;
    u32Tmp2 = M4_TMR63->STFLR & (BIT_MASK_11 | BIT_MASK_12);
    if ((u32Tmp1 & u32Tmp2) && (VSSEL132 & BIT_MASK_12))
    {
        Timer63SCMB_IrqHandler();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.136 share IRQ handler
 **
 ******************************************************************************/
void IRQ136_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t VSSEL136 = M4_INTC->VSSEL136;

    u32Tmp1 = M4_TMRA1->BCSTR;
    /* TimerA Ch.1 overflow */
    if ((u32Tmp1 & BIT_MASK_12) && (u32Tmp1 & BIT_MASK_14) && (VSSEL136 & BIT_MASK_00))
    {
        TimerA1OV_IrqHandler();
    }
    /* TimerA Ch.1 underflow */
    if ((u32Tmp1 & BIT_MASK_13) && (u32Tmp1 & BIT_MASK_15) && (VSSEL136 & BIT_MASK_01))
    {
        TimerA1UD_IrqHandler();
    }
    u32Tmp1 = M4_TMRA1->ICONR;
    u32Tmp2 = M4_TMRA1->STFLR;
    /* TimerA Ch.1 compare match */
    if ((u32Tmp1 & u32Tmp2 & 0xFFul) && (VSSEL136 & BIT_MASK_02))
    {
        TimerA1CMP_IrqHandler();
    }

    u32Tmp1 = M4_TMRA2->BCSTR;
    /* TimerA Ch.2 overflow */
    if ((u32Tmp1 & BIT_MASK_12) && (u32Tmp1 & BIT_MASK_14) && (VSSEL136 & BIT_MASK_03))
    {
        TimerA2OV_IrqHandler();
    }
    /* TimerA Ch.2 underflow */
    if ((u32Tmp1 & BIT_MASK_13) && (u32Tmp1 & BIT_MASK_15) && (VSSEL136 & BIT_MASK_04))
    {
        TimerA2UD_IrqHandler();
    }
    u32Tmp1 = M4_TMRA2->ICONR;
    u32Tmp2 = M4_TMRA2->STFLR;
    /* TimerA Ch.2 compare match */
    if ((u32Tmp1 & u32Tmp2 & 0xFFul) && (VSSEL136 & BIT_MASK_05))
    {
        TimerA2CMP_IrqHandler();
    }

