RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_interrupts.c
    u32Tmp1 = M4_TMRA3->BCSTR;
    /* TimerA Ch.3 overflow */
    if ((u32Tmp1 & BIT_MASK_12) && (u32Tmp1 & BIT_MASK_14) && (VSSEL136 & BIT_MASK_06))
    {
        TimerA3OV_IrqHandler();
    }
    /* TimerA Ch.3 underflow */
    if ((u32Tmp1 & BIT_MASK_13) && (u32Tmp1 & BIT_MASK_15) && (VSSEL136 & BIT_MASK_07))
    {
        TimerA3UD_IrqHandler();
    }
    u32Tmp1 = M4_TMRA3->ICONR;
    u32Tmp2 = M4_TMRA3->STFLR;
    /* TimerA Ch.3 compare match */
    if ((u32Tmp1 & u32Tmp2 & 0xFFul) && (VSSEL136 & BIT_MASK_08))
    {
        TimerA3CMP_IrqHandler();
    }

    u32Tmp1 = M4_TMRA4->BCSTR;
    /* TimerA Ch.4 overflow */
    if ((u32Tmp1 & BIT_MASK_12) && (u32Tmp1 & BIT_MASK_14) && (VSSEL136 & BIT_MASK_09))
    {
        TimerA4OV_IrqHandler();
    }
    /* TimerA Ch.4 underflow */
    if ((u32Tmp1 & BIT_MASK_13) && (u32Tmp1 & BIT_MASK_15) && (VSSEL136 & BIT_MASK_10))
    {
        TimerA4UD_IrqHandler();
    }
    u32Tmp1 = M4_TMRA4->ICONR;
    u32Tmp2 = M4_TMRA4->STFLR;
    /* TimerA Ch.4 compare match */
    if ((u32Tmp1 & u32Tmp2 & 0xFFul) && (VSSEL136 & BIT_MASK_11))
    {
        TimerA4CMP_IrqHandler();
    }

    u32Tmp1 = M4_TMRA5->BCSTR;
    /* TimerA Ch.5 overflow */
    if ((u32Tmp1 & BIT_MASK_12) && (u32Tmp1 & BIT_MASK_14) && (VSSEL136 & BIT_MASK_12))
    {
        TimerA5OV_IrqHandler();
    }
    /* TimerA Ch.5 underflow */
    if ((u32Tmp1 & BIT_MASK_13) && (u32Tmp1 & BIT_MASK_15) && (VSSEL136 & BIT_MASK_13))
    {
        TimerA5UD_IrqHandler();
    }
    u32Tmp1 = M4_TMRA5->ICONR;
    u32Tmp2 = M4_TMRA5->STFLR;
    /* TimerA Ch.5 compare match */
    if ((u32Tmp1 & u32Tmp2 & 0xFFul) && (VSSEL136 & BIT_MASK_14))
    {
        TimerA5CMP_IrqHandler();
    }

    u32Tmp1 = M4_TMRA6->BCSTR;
    /* TimerA Ch.6 overflow */
    if ((u32Tmp1 & BIT_MASK_12) && (u32Tmp1 & BIT_MASK_14) && (VSSEL136 & BIT_MASK_16))
    {
        TimerA6OV_IrqHandler();
    }
    /* TimerA Ch.6 underflow */
    if ((u32Tmp1 & BIT_MASK_13) && (u32Tmp1 & BIT_MASK_15) && (VSSEL136 & BIT_MASK_17))
    {
        TimerA6UD_IrqHandler();
    }
    u32Tmp1 = M4_TMRA6->ICONR;
    u32Tmp2 = M4_TMRA6->STFLR;
    /* TimerA Ch.6 compare match */
    if ((u32Tmp1 & u32Tmp2 & 0xFFul) && (VSSEL136 & BIT_MASK_18))
    {
        TimerA6CMP_IrqHandler();
    }
    /* USBFS global interrupt */
    if(1ul == bM4_USBFS_GAHBCFG_GINTMSK)
    {
        u32Tmp1 = M4_USBFS->GINTMSK & 0xF77CFCFBul;
        u32Tmp2 = M4_USBFS->GINTSTS & 0xF77CFCFBul;
        if ((u32Tmp1 & u32Tmp2) && (VSSEL136 & BIT_MASK_19))
        {
            UsbGlobal_IrqHandler();
        }
    }

    u32Tmp1 = M4_USART1->SR;
    u32Tmp2 = M4_USART1->CR1;
    /* USART Ch.1 Receive error */
    if ((u32Tmp2 & BIT_MASK_05) && (u32Tmp1 & (BIT_MASK_00 | BIT_MASK_01 | BIT_MASK_03)) && (VSSEL136 & BIT_MASK_22))
    {
        Usart1RxErr_IrqHandler();
    }
    /* USART Ch.1 Receive completed */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_05) && (VSSEL136 & BIT_MASK_23))
    {
        Usart1RxEnd_IrqHandler();
    }
    /* USART Ch.1 Transmit data empty */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_07) && (VSSEL136 & BIT_MASK_24))
    {
        Usart1TxEmpty_IrqHandler();
    }
    /* USART Ch.1 Transmit completed */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_06) && (VSSEL136 & BIT_MASK_25))
    {
        Usart1TxEnd_IrqHandler();
    }
    /* USART Ch.1 Receive timeout */
    if ((u32Tmp2 & BIT_MASK_01) && (u32Tmp1 & BIT_MASK_08) && (VSSEL136 & BIT_MASK_26))
    {
        Usart1RxTO_IrqHandler();
    }

    u32Tmp1 = M4_USART2->SR;
    u32Tmp2 = M4_USART2->CR1;
    /* USART Ch.2 Receive error */
    if ((u32Tmp2 & BIT_MASK_05) && (u32Tmp1 & (BIT_MASK_00 | BIT_MASK_01 | BIT_MASK_03)) && (VSSEL136 & BIT_MASK_27))
    {
        Usart2RxErr_IrqHandler();
    }
    /* USART Ch.2 Receive completed */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_05) && (VSSEL136 & BIT_MASK_28))
    {
        Usart2RxEnd_IrqHandler();
    }
    /* USART Ch.2 Transmit data empty */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_07) && (VSSEL136 & BIT_MASK_29))
    {
        Usart2TxEmpty_IrqHandler();
    }
    /* USART Ch.2 Transmit completed */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_06) && (VSSEL136 & BIT_MASK_30))
    {
        Usart2TxEnd_IrqHandler();
    }
    /* USART Ch.2 Receive timeout */
    if ((u32Tmp2 & BIT_MASK_01) && (u32Tmp1 & BIT_MASK_08) && (VSSEL136 & BIT_MASK_31))
    {
        Usart2RxTO_IrqHandler();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.137 share IRQ handler
 **
 ******************************************************************************/
void IRQ137_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t VSSEL137 = M4_INTC->VSSEL137;

    u32Tmp1 = M4_USART3->SR;
    u32Tmp2 = M4_USART3->CR1;
    /* USART Ch.3 Receive error */
    if ((u32Tmp2 & BIT_MASK_05) && (u32Tmp1 & (BIT_MASK_00 | BIT_MASK_01 | BIT_MASK_03)) && (VSSEL137 & BIT_MASK_00))
    {
        Usart3RxErr_IrqHandler();
    }
    /* USART Ch.3 Receive completed */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_05) && (VSSEL137 & BIT_MASK_01))
    {
        Usart3RxEnd_IrqHandler();
    }
    /* USART Ch.3 Transmit data empty */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_07) && (VSSEL137 & BIT_MASK_02))
    {
        Usart3TxEmpty_IrqHandler();
    }
    /* USART Ch.3 Transmit completed */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_06) && (VSSEL137 & BIT_MASK_03))
    {
        Usart3TxEnd_IrqHandler();
    }
    /* USART Ch.3 Receive timeout */
    if ((u32Tmp2 & BIT_MASK_01) && (u32Tmp1 & BIT_MASK_08) && (VSSEL137 & BIT_MASK_04))
    {
        Usart3RxTO_IrqHandler();
    }

    u32Tmp1 = M4_USART4->SR;
    u32Tmp2 = M4_USART4->CR1;
    /* USART Ch.4 Receive error */
    if ((u32Tmp2 & BIT_MASK_05) && (u32Tmp1 & (BIT_MASK_00 | BIT_MASK_01 | BIT_MASK_03)) && (VSSEL137 & BIT_MASK_05))
    {
        Usart4RxErr_IrqHandler();
    }
    /* USART Ch.4 Receive completed */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_05) && (VSSEL137 & BIT_MASK_06))
    {
        Usart4RxEnd_IrqHandler();
    }
    /* USART Ch.4 Transmit data empty */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_07) && (VSSEL137 & BIT_MASK_07))
    {
        Usart4TxEmpty_IrqHandler();
    }
    /* USART Ch.4 Transmit completed */
    if ((u32Tmp2 & u32Tmp1 & BIT_MASK_06) && (VSSEL137 & BIT_MASK_08))
    {
        Usart4TxEnd_IrqHandler();
    }
    /* USART Ch.4 Receive timeout */
    if ((u32Tmp2 & BIT_MASK_01) && (u32Tmp1 & BIT_MASK_08) && (VSSEL137 & BIT_MASK_09))
    {
        Usart4RxTO_IrqHandler();
    }

