RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_interrupts.c
    u32Tmp1 = M4_TMR43->OCSRV;
    /* Timer4 Ch.3 V phase higher compare match */
    if ((VSSEL139 & BIT_MASK_02) && (u32Tmp1 & BIT_MASK_04) && (u32Tmp1 & BIT_MASK_06))
    {
        Timer43GCMVH_IrqHandler();
    }
    /* Timer4 Ch.3 V phase lower compare match */
    if ((VSSEL139 & BIT_MASK_03) && (u32Tmp1 & BIT_MASK_05) && (u32Tmp1 & BIT_MASK_07))
    {
        Timer43GCMVL_IrqHandler();
    }

    u32Tmp1 = M4_TMR43->OCSRW;
    /* Timer4 Ch.3 W phase higher compare match */
    if ((VSSEL139 & BIT_MASK_04) && (u32Tmp1 & BIT_MASK_04) && (u32Tmp1 & BIT_MASK_06))
    {
        Timer43GCMWH_IrqHandler();
    }
    /* Timer4 Ch.3 W phase lower compare match */
    if ((VSSEL139 & BIT_MASK_05) && (u32Tmp1 & BIT_MASK_05) && (u32Tmp1 & BIT_MASK_07))
    {
        Timer43GCMWL_IrqHandler();
    }

    u32Tmp1 = M4_TMR43->CCSR;
    /* Timer4 Ch.3 overflow */
    if ((VSSEL139 & BIT_MASK_06) && (u32Tmp1 & BIT_MASK_08) && (u32Tmp1 & BIT_MASK_09))
    {
        Timer43GOV_IrqHandler();
    }
    /* Timer4 Ch.3 underflow */
    if ((VSSEL139 & BIT_MASK_07) && (u32Tmp1 & BIT_MASK_13) && (u32Tmp1 & BIT_MASK_14))
    {
        Timer43GUD_IrqHandler();
    }

    u32Tmp1 = M4_TMR43->RCSR;
    /* Timer4 Ch.3 U phase reload */
    if ((VSSEL139 & BIT_MASK_08) && (~(u32Tmp1 & BIT_MASK_00)) && (u32Tmp1 & BIT_MASK_04))
    {
        Timer41ReloadU_IrqHandler();
    }
    /* Timer4 Ch.3 V phase reload */
    if ((VSSEL139 & BIT_MASK_09) && (~(u32Tmp1 & BIT_MASK_01)) && (u32Tmp1 & BIT_MASK_08))
    {
        Timer43ReloadV_IrqHandler();
    }
    /* Timer4 Ch.3 W phase reload */
    if ((VSSEL139 & BIT_MASK_10) && (~(u32Tmp1 & BIT_MASK_02)) && (u32Tmp1 & BIT_MASK_12))
    {
        Timer43ReloadW_IrqHandler();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.140 share IRQ handler
 **
 ******************************************************************************/
void IRQ140_Handler(void)
{
    uint32_t VSSEL140 = M4_INTC->VSSEL140;
    uint32_t u32Tmp1 = 0u;
    uint32_t u32Tmp2 = 0u;
    /* EMB1 */
    u32Tmp1 = M4_EMB1->STAT & 0x0000000Ful;
    u32Tmp2 = M4_EMB1->INTEN & 0x0000000Ful;
    if ((u32Tmp1 & u32Tmp2) && (VSSEL140 & BIT_MASK_06))
    {
        Emb1_IrqHandler();
    }
    /* EMB2 */
    u32Tmp1 = M4_EMB2->STAT & 0x0000000Ful;
    u32Tmp2 = M4_EMB2->INTEN & 0x0000000Ful;
    if ((u32Tmp1 & u32Tmp2) && (VSSEL140 & BIT_MASK_07))
    {
        Emb2_IrqHandler();
    }
    /* EMB3 */
    u32Tmp1 = M4_EMB3->STAT & 0x0000000Ful;
    u32Tmp2 = M4_EMB3->INTEN & 0x0000000Ful;
    if ((u32Tmp1 & u32Tmp2) && (VSSEL140 & BIT_MASK_08))
    {
        Emb3_IrqHandler();
    }
    /* EMB4*/
    u32Tmp1 = M4_EMB4->STAT & 0x0000000Ful;
    u32Tmp2 = M4_EMB4->INTEN & 0x0000000Ful;
    if ((u32Tmp1 & u32Tmp2) && (VSSEL140 & BIT_MASK_09))
    {
        Emb4_IrqHandler();
    }

    /* I2S Ch.1 Transmit */
    if(1ul == bM4_I2S1_CTRL_TXIE)
    {
        if ((1ul == bM4_I2S1_SR_TXBA) && (VSSEL140 & BIT_MASK_16))
        {
            I2s1Tx_IrqHandler();
        }
    }
    /* I2S Ch.1 Receive */
    if(1ul == bM4_I2S1_CTRL_RXIE)
    {
        if ((1ul == bM4_I2S1_SR_RXBA) && (VSSEL140 & BIT_MASK_17))
        {
            I2s1Rx_IrqHandler();
        }
    }
    /* I2S Ch.1 Error */
    if(1ul == bM4_I2S1_CTRL_EIE)
    {
        if ((M4_I2S1->ER & (BIT_MASK_00 | BIT_MASK_01)) && (VSSEL140 & BIT_MASK_18))
        {
            I2s1Err_IrqHandler();
        }
    }
    /* I2S Ch.2 Transmit */
    if(1ul == bM4_I2S2_CTRL_TXIE)
    {
        if ((1ul == bM4_I2S2_SR_TXBA) && (VSSEL140 & BIT_MASK_19))
        {
            I2s2Tx_IrqHandler();
        }
    }
    /* I2S Ch.2 Receive */
    if(1ul == bM4_I2S2_CTRL_RXIE)
    {
        if ((1ul == bM4_I2S2_SR_RXBA) && (VSSEL140 & BIT_MASK_20))
        {
            I2s2Rx_IrqHandler();
        }
    }
    /* I2S Ch.2 Error */
    if(1ul == bM4_I2S2_CTRL_EIE)
    {
        if ((M4_I2S2->ER & (BIT_MASK_00 | BIT_MASK_01)) && (VSSEL140 & BIT_MASK_21))
        {
            I2s2Err_IrqHandler();
        }
    }
    /* I2S Ch.3 Transmit */
    if(1ul == bM4_I2S3_CTRL_TXIE)
    {
        if ((1ul == bM4_I2S3_SR_TXBA) && (VSSEL140 & BIT_MASK_22))
        {
            I2s3Tx_IrqHandler();
        }
    }
    /* I2S Ch.3 Receive */
    if(1ul == bM4_I2S3_CTRL_RXIE)
    {
        if ((1ul == bM4_I2S3_SR_RXBA) && (VSSEL140 & BIT_MASK_23))
        {
            I2s3Rx_IrqHandler();
        }
    }
    /* I2S Ch.3 Error */
    if(1ul == bM4_I2S3_CTRL_EIE)
    {
        if ((M4_I2S3->ER & (BIT_MASK_00 | BIT_MASK_01)) && (VSSEL140 & BIT_MASK_24))
        {
            I2s3Err_IrqHandler();
        }
    }
    /* I2S Ch.4 Transmit */
    if(1ul == bM4_I2S4_CTRL_TXIE)
    {
        if ((1ul == bM4_I2S4_SR_TXBA) && (VSSEL140 & BIT_MASK_25))
        {
            I2s4Tx_IrqHandler();
        }
    }
    /* I2S Ch.4 Receive */
    if(1ul == bM4_I2S4_CTRL_RXIE)
    {
        if ((1ul == bM4_I2S4_SR_RXBA) && (VSSEL140 & BIT_MASK_26))
        {
            I2s4Rx_IrqHandler();
        }
    }
    /* I2S Ch.4 Error */
    if(1ul == bM4_I2S4_CTRL_EIE)
    {
        if ((M4_I2S4->ER & (BIT_MASK_00 | BIT_MASK_01)) && (VSSEL140 & BIT_MASK_27))
        {
            I2s4Err_IrqHandler();
        }
    }
}

/**
 *******************************************************************************
 ** \brief Int No.141 share IRQ handler
 **
 ******************************************************************************/
void IRQ141_Handler(void)
{
    uint32_t  VSSEL141 = M4_INTC->VSSEL141;
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    /* I2C Ch.1 Receive completed */
    if(1ul == bM4_I2C1_CR2_RFULLIE)
    {
        if ((1ul == bM4_I2C1_SR_RFULLF) && (VSSEL141 & BIT_MASK_04))
        {
            I2c1RxEnd_IrqHandler();
        }
    }
    /* I2C Ch.1 Transmit data empty */
    if(1ul == bM4_I2C1_CR2_TEMPTYIE)
    {
        if ((1ul == bM4_I2C1_SR_TEMPTYF) && (VSSEL141 & BIT_MASK_05))
        {
            I2c1TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.1 Transmit completed */
    if(1ul == bM4_I2C1_CR2_TENDIE)
    {
        if ((1ul == bM4_I2C1_SR_TENDF) && (VSSEL141 & BIT_MASK_06))
        {
            I2c1TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.1 Error */
    u32Tmp1 = M4_I2C1->CR2 & 0x00F05217ul;
    u32Tmp2 = M4_I2C1->SR & 0x00F05217ul;
    if ((u32Tmp1 & u32Tmp2) && (VSSEL141 & BIT_MASK_07))
    {
        I2c1Err_IrqHandler();
    }
    /* I2C Ch.2 Receive completed */
    if(1ul == bM4_I2C2_CR2_RFULLIE)
    {
        if ((1ul == bM4_I2C2_SR_RFULLF) && (VSSEL141 & BIT_MASK_08))
        {
            I2c2RxEnd_IrqHandler();
        }
    }
    /* I2C Ch.2 Transmit data empty */
    if(1ul == bM4_I2C2_CR2_TEMPTYIE)
    {
        if ((1ul == bM4_I2C2_SR_TEMPTYF) && (VSSEL141 & BIT_MASK_09))
        {
            I2c2TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.2 Transmit completed */
    if(1ul == bM4_I2C2_CR2_TENDIE)
    {
        if ((1ul == bM4_I2C2_SR_TENDF)  && (VSSEL141 & BIT_MASK_10))
        {
            I2c2TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.2 Error */
    u32Tmp1 = M4_I2C2->CR2 & 0x00F05217ul;
    u32Tmp2 = M4_I2C2->SR & 0x00F05217ul;
    if ((u32Tmp1 & u32Tmp2) && (VSSEL141 & BIT_MASK_11))
    {
        I2c2Err_IrqHandler();
    }
    /* I2C Ch.3 Receive completed */
    if(1ul == bM4_I2C3_CR2_RFULLIE)
    {
        if ((1ul == bM4_I2C3_SR_RFULLF) && (VSSEL141 & BIT_MASK_12))
        {
            I2c3RxEnd_IrqHandler();
        }
    }
    /* I2C Ch.3 Transmit data empty */
    if(1ul == bM4_I2C3_CR2_TEMPTYIE)
    {
        if ((1ul == bM4_I2C3_SR_TEMPTYF) && (VSSEL141 & BIT_MASK_13))
        {
            I2c3TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.3 Transmit completed */
    if(1ul == bM4_I2C3_CR2_TENDIE)
    {
        if ((1ul == bM4_I2C3_SR_TENDF)  && (VSSEL141 & BIT_MASK_14))
        {
            I2c3TxEnd_IrqHandler();
        }
    }
    /* I2C Ch.3 Error */
    u32Tmp1 = M4_I2C3->CR2 & 0x00F05217ul;
    u32Tmp2 = M4_I2C3->SR & 0x00F05217ul;
    if ((u32Tmp1 & u32Tmp2) && (VSSEL141 & BIT_MASK_15))
    {
        I2c3Err_IrqHandler();
    }
    /* PVD Ch.1 detected */
    if (1ul == M4_SYSREG->PWR_PVDDSR_f.PVD1DETFLG)
    {
        if((1ul == bM4_SYSREG_PWR_PVDDSR_PVD1DETFLG) && (VSSEL141 & BIT_MASK_17))
        {
            Pvd1_IrqHandler();
        }
    }
    if (1ul == M4_SYSREG->PWR_PVDDSR_f.PVD2DETFLG)
    {
        /* PVD Ch.2 detected */
        if((1ul == bM4_SYSREG_PWR_PVDDSR_PVD2DETFLG) && (VSSEL141 & BIT_MASK_18))
        {
            Pvd2_IrqHandler();
        }
    }
    /* Freq. calculate error detected */
    if(1ul == bM4_FCM_RIER_ERRIE)
    {
        if((1ul == bM4_FCM_SR_ERRF) && (VSSEL141 & BIT_MASK_20))
        {
            FcmErr_IrqHandler();
        }
    }
    /* Freq. calculate completed */
    if(1ul == bM4_FCM_RIER_MENDIE)
    {
        if((1ul == bM4_FCM_SR_MENDF) && (VSSEL141 & BIT_MASK_21))
        {
            FcmEnd_IrqHandler();
        }
    }
    /* Freq. calculate overflow */
    if(1ul == bM4_FCM_RIER_OVFIE)
    {
        if((1ul == bM4_FCM_SR_OVF) && (VSSEL141 & BIT_MASK_22))
        {
            FcmOV_IrqHandler();
        }
    }

