RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_interrupts.c
    /* WDT */
    if ((M4_WDT->SR & (BIT_MASK_16 | BIT_MASK_17)) && (VSSEL141 & BIT_MASK_23))
    {
        Wdt_IrqHandler();
    }
}

/**
 *******************************************************************************
 ** \brief Int No.142 share IRQ handler
 **
 ******************************************************************************/
void IRQ142_Handler(void)
{
    uint32_t u32VSSEL142 = M4_INTC->VSSEL142;
    uint16_t u16Tmp = 0u;
    /* ADC unit.1 seq. A */
    if (1ul == bM4_ADC1_ICR_EOCAIEN)
    {
        if ((1ul == bM4_ADC1_ISR_EOCAF) && (u32VSSEL142 & BIT_MASK_00))
        {
            ADC1A_IrqHandler();
        }
    }
    /* ADC unit.1 seq. B */
    if (1ul == bM4_ADC1_ICR_EOCBIEN)
    {
        if ((1ul == bM4_ADC1_ISR_EOCBF) && (u32VSSEL142 & BIT_MASK_01))
        {
            ADC1B_IrqHandler();
        }
    }
    /* ADC unit.1 seq. A */
    u16Tmp = M4_ADC1->AWDSR0;
    if (1ul == bM4_ADC1_AWDCR_AWDIEN)
    {
        if (((1ul == bM4_ADC1_AWDSR1_AWDF16) || (u16Tmp)) && (u32VSSEL142 & BIT_MASK_02))
        {
            ADC1ChCmp_IrqHandler();
        }
    }
    /* ADC unit.1 seq. cmp */
    if (1ul == bM4_ADC1_AWDCR_AWDIEN)
    {
        if (((1ul == bM4_ADC1_AWDSR1_AWDF16) || (u16Tmp)) && (u32VSSEL142 & BIT_MASK_03))
        {
            ADC1SeqCmp_IrqHandler();
        }
    }

    /* ADC unit.2 seq. A */
    if (1ul == bM4_ADC2_ICR_EOCAIEN)
    {
        if ((1ul == bM4_ADC2_ISR_EOCAF) && (u32VSSEL142 & BIT_MASK_04))
        {
            ADC2A_IrqHandler();
        }
    }
    /* ADC unit.2 seq. B */
    if (1ul == bM4_ADC2_ICR_EOCBIEN)
    {
        if ((1ul == bM4_ADC2_ISR_EOCBF) && (u32VSSEL142 & BIT_MASK_05))
        {
            ADC2B_IrqHandler();
        }
    }
    /* ADC unit.2 seq. A */
    if (1ul == bM4_ADC2_AWDCR_AWDIEN)
    {
        if ((M4_ADC2->AWDSR0 & 0x1FFu) && (u32VSSEL142 & BIT_MASK_06))
        {
            ADC2ChCmp_IrqHandler();
        }
    }
    /* ADC unit.2 seq. cmp */
    if (1ul == bM4_ADC2_AWDCR_AWDIEN)
    {
        if ((M4_ADC2->AWDSR0 & 0x1FFu) && (u32VSSEL142 & BIT_MASK_07))
        {
            ADC2SeqCmp_IrqHandler();
        }
    }
}

/**
 *******************************************************************************
 ** \brief Int No.143 share IRQ handler
 **
 ******************************************************************************/
void IRQ143_Handler(void)
{
    uint8_t RTIF = 0u;
    uint8_t RTIE = 0u;
    uint8_t ERRINT = 0u;
    uint8_t TTCFG = 0u;
    uint16_t NORINTST = 0u;
    uint16_t NORINTSGEN = 0u;
    uint16_t ERRINTST = 0u;
    uint16_t ERRINTSGEN = 0u;

    /* SDIO Ch.1 */
    if (1ul == bM4_INTC_VSSEL143_VSEL2)
    {
        NORINTST = M4_SDIOC1->NORINTST;
        NORINTSGEN = M4_SDIOC1->NORINTSGEN;
        ERRINTST = M4_SDIOC1->ERRINTST;
        ERRINTSGEN = M4_SDIOC1->ERRINTSGEN;

        if ((NORINTST & NORINTSGEN & 0x1F7u) || (ERRINTST & ERRINTSGEN & 0x017Fu))
        {
            Sdio1_IrqHandler();
        }
    }

    /* SDIO Ch.2 */
    if (1ul == bM4_INTC_VSSEL143_VSEL5)
    {
        NORINTST = M4_SDIOC2->NORINTST;
        NORINTSGEN = M4_SDIOC2->NORINTSGEN;
        ERRINTST = M4_SDIOC2->ERRINTST;
        ERRINTSGEN = M4_SDIOC2->ERRINTSGEN;

        if ((NORINTST & NORINTSGEN & 0x1F7u) || (ERRINTST & ERRINTSGEN & 0x017Fu))
        {
            Sdio2_IrqHandler();
        }
    }

    /* CAN */
    if (1ul == bM4_INTC_VSSEL143_VSEL6)
    {
        RTIF = M4_CAN->RTIF;
        RTIE = M4_CAN->RTIE;
        ERRINT = M4_CAN->ERRINT;
        TTCFG = M4_CAN->TTCFG;
        if ( (TTCFG & BIT_MASK_05)                                  ||         \
             (RTIF & BIT_MASK_00)                                   ||         \
             (RTIF & RTIE & 0xFEu)                                  ||         \
             ((ERRINT & BIT_MASK_00) && (ERRINT & BIT_MASK_01))     ||         \
             ((ERRINT & BIT_MASK_02) && (ERRINT & BIT_MASK_03))     ||         \
             ((ERRINT & BIT_MASK_04) && (ERRINT & BIT_MASK_05))     ||         \
             ((TTCFG & BIT_MASK_03) && (TTCFG & BIT_MASK_04))       ||         \
             ((TTCFG & BIT_MASK_06) && (TTCFG & BIT_MASK_07)))
        {
            Can_IrqHandler();
        }
    }
}

#endif

//@} // InterruptGroup

#endif /* DDL_INTERRUPTS_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
